Conf.Simple/src/InformationRegisters/SUI_СеансыМобильныхУстройств/SUI_СеансыМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СеансыМобильныхУстройств</name>
  <resources>
    <name>Сеанс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СеансыМобильныхУстройств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Записать(МобильноеУстройство, ВерсияПриложения = Неопределено) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.МобильноеУстройство = МобильноеУстройство;
	МенеджерЗаписи.ВерсияПриложения = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(ВерсияПриложения);
	МенеджерЗаписи.Сеанс = НомерСеансаИнформационнойБазы();
	МенеджерЗаписи.ДатаСеанса = ТекущаяДатаСеанса();
	МенеджерЗаписи.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция СрокДействительностиСеансаВСекундах() Экспорт
	Возврат 60*60*24*3; // 3-ое суток
КонецФункции

#КонецОбласти

#КонецЕсли
